# ShowGrandTotal Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ScheduleDefinition..::..ShowGrandTotal Property
ScheduleDefinition Class See Also
---
Indicates if a grand total row should be displayed at the bottom of the schedule.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool ShowGrandTotal { get; set; }
```

Visual Basic
---
```text
Public Property ShowGrandTotal As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool ShowGrandTotal {
	bool get ();
	void set (bool value);
}
```

# ### Field Value
True if a grand total row should be displayed, false otherwise.
# Remarks
The grand total row displays totals of each field for which totals are enabled. It can also optionally display a title (see ShowGrandTotalTitle) and a count of elements (see ShowGrandTotalCount).
# See Also
ScheduleDefinition Class
Autodesk.Revit.DB Namespace